html/jcip/composing_objects.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>对象组合</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="sharing_objects.html"> UP </a>
 |
 <a accesskey="H" href="jcip.html"> HOME </a>
</div><div id="content">
<h1 class="title">对象组合</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">设计线程安全的类　</a>
<ul>
<li><a href="#sec-1-1">后置条件</a></li>
<li><a href="#sec-1-2">前置条件</a></li>
</ul>
</li>
<li><a href="#sec-2">委托线程安全</a></li>
<li><a href="#sec-3">对现有类添加线程安全</a>
<ul>
<li><a href="#sec-3-1">继承现有类</a></li>
<li><a href="#sec-3-2">客户端加锁　</a></li>
<li><a href="#sec-3-3">对象组合</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">设计线程安全的类　</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>确定组成对象状态的变量
</li>
<li>确定约束对象状态的不变式
</li>
<li>建立并发访问对象状态的规则
</li>
</ol>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">后置条件</h3>
<div class="outline-text-3" id="text-1-1">
<p>
某些变量的取值是有限制范围的, 改变状态变量之后需要检查改变后的状态是否合法, 需要额外同步
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">前置条件</h3>
<div class="outline-text-3" id="text-1-2">
<p>
满足一定的条件操作才能继续进行, 使用wait/notfiy, blocking queue, semaphore
</p>

<ul class="org-ul">
<li>对象限制
</li>
<li>对象限制在类范围内(作为类的私有成员) 
<ol class="org-ol">
<li>对象限制在方法内部(作为方法的局部变量)　
</li>
<li>对象限制在线程范围内(只能在特定线程中访问该对象)　
</li>
</ol>
<p>
** monitor模式
</p>
</li>
</ul>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">PrivateLock</span> {
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Object</span> <span style="color: #eedd82;">myLock</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Object</span>();
    <span style="color: #7fffd4;">@GuardedBy</span>(<span style="color: #ffa07a;">"myLock"</span>) <span style="color: #98fb98;">Widget</span> <span style="color: #eedd82;">widget</span>;
    <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">someMethod</span>() {
        <span style="color: #00ffff;">synchronized</span>(myLock) {
            <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Access or modify the state of widget</span>
        }
    }
}
</pre>
</div>
<p>
使用一个额外对象加锁比使用java内置锁更灵活
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">委托线程安全</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>如果类只包含一个状态变量, 那么类是否是线程安全的, 取决于该状态变量是否是线程安全
</li>
<li>如果类中的多个状态变量之间是相互独立的, 那么线程安全的责任仍可以委托给状态变量
</li>
<li>如果类中的多个状态变量参与不变式，那需要额外的同步
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">对现有类添加线程安全</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">继承现有类</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">BetterVector</span>&lt;<span style="color: #98fb98;">E</span>&gt; <span style="color: #00ffff;">extends</span> <span style="color: #98fb98;">Vector</span>&lt;<span style="color: #98fb98;">E</span>&gt; {
    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">synchronized</span> <span style="color: #98fb98;">boolean</span> <span style="color: #87cefa;">putIfAbsent</span>(<span style="color: #98fb98;">E</span> <span style="color: #eedd82;">x</span>) {
        <span style="color: #98fb98;">boolean</span> <span style="color: #eedd82;">absent</span> = !contains(x);
        <span style="color: #00ffff;">if</span> (absent)
            add(x);
        <span style="color: #00ffff;">return</span> absent;
    }
}
</pre>
</div>
<p>
如果父类修改了，就可能破坏子类的同步性，比如contains的含义变化了　
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">客户端加锁　</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">ListHelper</span>&lt;<span style="color: #98fb98;">E</span>&gt; {
    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">List</span>&lt;<span style="color: #98fb98;">E</span>&gt; <span style="color: #eedd82;">list</span> =
        Collections.synchronizedList(<span style="color: #00ffff;">new</span> <span style="color: #98fb98;">ArrayList</span>&lt;<span style="color: #98fb98;">E</span>&gt;());
    ...
        <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">boolean</span> putIfAbsent(<span style="color: #98fb98;">E</span> <span style="color: #eedd82;">x</span>) {
            <span style="color: #00ffff;">synchronized</span> (list) {
                <span style="color: #98fb98;">boolean</span> <span style="color: #eedd82;">absent</span> = !list.contains(x);
                <span style="color: #00ffff;">if</span> (absent)
                    list.add(x);
                <span style="color: #00ffff;">return</span> absent;
            }
        }
}
</pre>
</div>
<p>
客户端加锁更糟糕，因为客户端加锁的策略很可能和被加锁的类自身的锁管理策略相违背　
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">对象组合</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #7fffd4;">@ThreadSafe</span>
<span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">ImprovedList</span>&lt;<span style="color: #98fb98;">T</span>&gt; <span style="color: #00ffff;">implements</span> <span style="color: #98fb98;">List</span>&lt;<span style="color: #98fb98;">T</span>&gt; {
    <span style="color: #00ffff;">private</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">List</span>&lt;<span style="color: #98fb98;">T</span>&gt; <span style="color: #eedd82;">list</span>;
    <span style="color: #00ffff;">public</span> <span style="color: #87cefa;">ImprovedList</span>(<span style="color: #98fb98;">List</span>&lt;<span style="color: #98fb98;">T</span>&gt; <span style="color: #eedd82;">list</span>) { <span style="color: #00ffff;">this</span>.list = list; }
    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">synchronized</span> <span style="color: #98fb98;">boolean</span> <span style="color: #87cefa;">putIfAbsent</span>(<span style="color: #98fb98;">T</span> <span style="color: #eedd82;">x</span>) {
        <span style="color: #98fb98;">boolean</span> <span style="color: #eedd82;">contains</span> = list.contains(x);
        <span style="color: #00ffff;">if</span> (contains)
            list.add(x);
        <span style="color: #00ffff;">return</span> !contains;
    }
    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">synchronized</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">clear</span>() { list.clear(); }
    <span style="color: #ff4500;">// </span><span style="color: #ff4500;">... similarly delegate other List methods</span>
}
</pre>
</div>
<p>
继承父类，把父类对象放进子类的一个final instance, 使用子类的内置锁进行同步
</p>


<p>
<a href="build_blocks.html">Next:基础模块</a>
</p>

<p>
<a href="sharing_objects.html">Previous:对象分享</a>
</p>

<p>
<a href="jcip.html">Up:目录</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

     <br/>
     <!-- DISQUS  -->
     <div id="disqus_thread"></div>
     <script type="text/javascript">
         /* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
         var disqus_shortname = 'https-klose911-github-io'; // required: replace example with your forum shortname

         /* * * DON'T EDIT BELOW THIS LINE * * */
         (function() {
             var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
             dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
             (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
         })();
     </script>
     <noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
     <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
  ga('create', 'UA-90850421-1', 'auto');
  ga('send', 'pageview');
</script>
</div>
</body>
</html>
